//加油哦
//我相信你
//计算机里没有黑魔法
//别人会的你也会

//打分系统
//完全肯定
#include <iostream>
using namespace std;

int main(){
    double a;
    char m[100000];
    cout << "你会给今天的自己打几分呢？"<<endl;
    cout <<"输入一个1-10之间的数吧！"<<endl;

    cin >> a;

    cout << "哈哈哈，我知道你给自己老老实实打了1-10分"<<endl;
    cin>>m;
    cout<<"但是呢，你在我心目中是最棒最聪明的！猜多少分？"<<endl;
    cin>>m;
    cout<<"我给你打分 924分，很惊讶吗？我这个分数按照你们人类的话说，是“我爱你”哦！所以，最终得分是最大的无穷大！"<<endl;
    cin>>m;
    cout<<"?你是说为什么吗？哈哈，按照你们人类的思维是无法解释的！因为，我爱你，没有理由"<<endl;

    return 0;
}

//好的开始源于两分钟的启动